Merge remote-tracking branch 'origin/main' into jthomson04/kvbm-vllm-fixes
